In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
feature = pd.read_csv('https://raw.githubusercontent.com/huaijiangzhu/SummerML/master/day5/fish_market_feature.csv')
label = pd.read_csv('https://raw.githubusercontent.com/huaijiangzhu/SummerML/master/day5/fish_market_label.csv')

In [3]:
feature

     Length1  Length2  Length3   Height   Width
0       11.7     12.4     13.5   2.4300  1.2690
1       19.0     20.7     23.2   9.3960  3.4104
2       38.0     41.0     46.5  17.6235  6.3705
3       13.2     14.3     15.2   2.8728  2.0672
4       37.3     40.0     43.5  12.3540  6.5250
..       ...      ...      ...      ...     ...
119     40.0     42.5     45.5   7.2800  4.3225
120     43.2     46.0     48.7   7.7920  4.8700
121     12.5     13.7     14.7   3.5280  1.9992
122     52.0     56.0     59.7  10.6863  6.9849
123     18.2     19.8     22.2   5.6166  3.1746

[124 rows x 5 columns]

In [4]:
label

     Weight
0      13.4
1     170.0
2     950.0
3      19.7
4    1000.0
..      ...
119   456.0
120   567.0
121    32.0
122  1250.0
123    87.0

[124 rows x 1 columns]